
// 坐标 x,y
export type Vector2 = [number, number]

// 坐标 x,y,z
export type Vector3 = [number, number, number]

export type CoordinateVector3s = Vector3[] | Vector3[][] | Vector3[][][];


/*
    z元素是可选的（如果z没有指定，则z==0）
        单个点：  一维数组
        单个环：  二维数组，注意：坐标点索引需要按顺时针或者逆时针排列
        单个Part：三维数组
        多个Part：四维数组
*/
let z = 0;


//1个Part, 无内环 Point[]
let c1: CoordinateVector3s = [[1, 1, z], [2, 2, z], [3, 3, z]];


//1个Part, 1到多个内环 Point[][]
let c2: CoordinateVector3s = [
    [[1, 1, z], [2, 2, z], [3, 3, z]],  //第一个元素是外环
    [[1, 1, z], [2, 2, z], [3, 3, z]],  //其他元素是内环
    [[1, 1, z], [2, 2, z], [3, 3, z]],
    [[1, 1, z], [2, 2, z], [3, 3, z]]
];


//多个Part，有的Part有内环，有的没有内环 Point[][][]
let c3: CoordinateVector3s = [
    //没有内环的Part
    [
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ],

    //有内环的Part
    [
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //第一个元素是外环
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //其他元素是内环
        [[1, 1, z], [2, 2, z], [3, 3, z]],
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ],

    //没有内环的Part
    [
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ]
];


//多个Part，每个Part有内环 Point[][][]
let c4: CoordinateVector3s = [
    [ //Part1
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //第一个元素是外环
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //其他元素是内环
        [[1, 1, z], [2, 2, z], [3, 3, z]],
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ],

    [ //Part2
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //第一个元素是外环
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //其他元素是内环
        [[1, 1, z], [2, 2, z], [3, 3, z]],
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ],

    [ //Part3
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //第一个元素是外环
        [[1, 1, z], [2, 2, z], [3, 3, z]],  //其他元素是内环
        [[1, 1, z], [2, 2, z], [3, 3, z]],
        [[1, 1, z], [2, 2, z], [3, 3, z]]
    ],
];
